#include <stdio.h>

int main() {
    int n; // кількість розрядів
    scanf("%d", &n);
    long long a = 1, b = 1, c = 0; // змінні для зберігання кількості чисел, що закінчуються на одну, дві або три однакові цифри
    for (int i = 1; i < n; i++) {
        long long ta = a, tb = b, tc = c;
        a = ta + tb + tc; // кількість чисел, що закінчуються на одну цифру
        b = ta; // кількість чисел, що закінчуються на дві однакові цифри
        c = tb; // кількість чисел, що закінчуються на три однакові цифри
    }
    printf("%lld\n", a + b); // виведення суми кількостей чисел, що закінчуються на одну або дві однакові цифри
    return 0;
}
